benchmark/results_visionfive2/memcached-cdf_offload.txt
8         Threads
4         Connections per thread
100000    Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         8033.79          ---          ---         0.36689         0.26300         2.02300         5.59900       618.91 
Gets        80336.97        64.51     80272.46         0.37050         0.26300         1.99900         5.53500      3050.89 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      88370.75        64.51     80272.46         0.37017         0.26300         2.00700         5.53500      3669.80 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.111        0.000
SET       0.183        5.000
SET       0.199       10.000
SET       0.207       15.000
SET       0.215       20.000
SET       0.223       25.000
SET       0.231       30.000
SET       0.239       35.000
SET       0.247       40.000
SET       0.255       45.000
SET       0.263       50.000
SET       0.271       52.500
SET       0.271       55.000
SET       0.279       57.500
SET       0.287       60.000
SET       0.295       62.500
SET       0.303       65.000
SET       0.311       67.500
SET       0.319       70.000
SET       0.335       72.500
SET       0.351       75.000
SET       0.359       76.250
SET       0.367       77.500
SET       0.375       78.750
SET       0.383       80.000
SET       0.391       81.250
SET       0.399       82.500
SET       0.407       83.750
SET       0.415       85.000
SET       0.423       86.250
SET       0.431       87.500
SET       0.439       88.125
SET       0.439       88.750
SET       0.447       89.375
SET       0.455       90.000
SET       0.455       90.625
SET       0.463       91.250
SET       0.471       91.875
SET       0.479       92.500
SET       0.495       93.125
SET       0.503       93.750
SET       0.511       94.062
SET       0.527       94.375
SET       0.535       94.688
SET       0.551       95.000
SET       0.575       95.312
SET       0.607       95.625
SET       0.663       95.938
SET       0.727       96.250
SET       0.791       96.562
SET       0.879       96.875
SET       0.943       97.031
SET       0.991       97.188
SET       1.047       97.344
SET       1.119       97.500
SET       1.183       97.656
SET       1.263       97.812
SET       1.343       97.969
SET       1.415       98.125
SET       1.495       98.281
SET       1.583       98.438
SET       1.631       98.516
SET       1.679       98.594
SET       1.727       98.672
SET       1.791       98.750
SET       1.855       98.828
SET       1.927       98.906
SET       2.007       98.984
SET       2.095       99.062
SET       2.191       99.141
SET       2.319       99.219
SET       2.367       99.258
SET       2.431       99.297
SET       2.511       99.336
SET       2.591       99.375
SET       2.671       99.414
SET       2.751       99.453
SET       2.863       99.492
SET       2.959       99.531
SET       3.055       99.570
SET       3.183       99.609
SET       3.263       99.629
SET       3.343       99.648
SET       3.407       99.668
SET       3.487       99.688
SET       3.567       99.707
SET       3.679       99.727
SET       3.791       99.746
SET       3.935       99.766
SET       4.063       99.785
SET       4.255       99.805
SET       4.351       99.814
SET       4.415       99.824
SET       4.543       99.834
SET       4.639       99.844
SET       4.735       99.854
SET       4.831       99.863
SET       5.023       99.873
SET       5.183       99.883
SET       5.375       99.893
SET       5.631       99.902
SET       5.727       99.907
SET       5.855       99.912
SET       6.047       99.917
SET       6.207       99.922
SET       6.335       99.927
SET       6.591       99.932
SET       6.783       99.937
SET       7.135       99.941
SET       7.455       99.946
SET       7.743       99.951
SET       7.871       99.954
SET       7.967       99.956
SET       8.191       99.958
SET       8.383       99.961
SET       8.639       99.963
SET       8.959       99.966
SET       9.407       99.968
SET       9.727       99.971
SET       9.919       99.973
SET      10.559       99.976
SET      10.815       99.977
SET      11.135       99.978
SET      11.455       99.979
SET      12.351       99.980
SET      13.119       99.982
SET      14.527       99.983
SET      15.871       99.984
SET      18.175       99.985
SET      19.199       99.987
SET      23.167       99.988
SET      28.671       99.988
SET     211.967       99.989
SET     211.967       99.990
SET     211.967       99.990
SET     212.991       99.991
SET     212.991       99.991
SET     214.015       99.992
SET     214.015       99.993
SET     214.015       99.993
SET     215.039       99.994
SET     215.039       99.994
SET     216.063       99.995
SET     216.063       99.995
SET     216.063       99.995
[...]
SET     216.063       99.996
SET     216.063       99.996
SET     217.087       99.996
SET     218.111       99.997
SET     218.111       99.997
SET     218.111       99.997
[...]
SET     218.111       99.998
SET     219.135       99.998
SET     219.135       99.998
SET     219.135       99.998
[...]
SET     219.135       99.999
SET     220.159       99.999
SET     220.159       99.999
SET     220.159       99.999
[...]
SET     221.183       99.999
SET     221.183       99.999
SET     221.183       99.999
[...]
SET     221.183      100.000
SET     221.183      100.000
SET     221.183      100.000
[...]
SET     223.231      100.000
SET     223.231      100.000
---
GET       0.095        0.000
GET       0.183        5.000
GET       0.191       10.000
GET       0.207       15.000
GET       0.215       20.000
GET       0.223       25.000
GET       0.231       30.000
GET       0.231       35.000
GET       0.239       40.000
GET       0.255       45.000
GET       0.263       50.000
GET       0.263       52.500
GET       0.271       55.000
GET       0.279       57.500
GET       0.279       60.000
GET       0.287       62.500
GET       0.295       65.000
GET       0.311       67.500
GET       0.319       70.000
GET       0.335       72.500
GET       0.351       75.000
GET       0.359       76.250
GET       0.367       77.500
GET       0.367       78.750
GET       0.375       80.000
GET       0.383       81.250
GET       0.391       82.500
GET       0.399       83.750
GET       0.407       85.000
GET       0.415       86.250
GET       0.431       87.500
GET       0.431       88.125
GET       0.439       88.750
GET       0.439       89.375
GET       0.447       90.000
GET       0.455       90.625
GET       0.463       91.250
GET       0.471       91.875
GET       0.479       92.500
GET       0.487       93.125
GET       0.503       93.750
GET       0.511       94.062
GET       0.519       94.375
GET       0.527       94.688
GET       0.543       95.000
GET       0.567       95.312
GET       0.599       95.625
GET       0.655       95.938
GET       0.719       96.250
GET       0.791       96.562
GET       0.879       96.875
GET       0.935       97.031
GET       0.991       97.188
GET       1.047       97.344
GET       1.111       97.500
GET       1.175       97.656
GET       1.239       97.812
GET       1.319       97.969
GET       1.399       98.125
GET       1.479       98.281
GET       1.567       98.438
GET       1.615       98.516
GET       1.663       98.594
GET       1.711       98.672
GET       1.775       98.750
GET       1.839       98.828
GET       1.911       98.906
GET       1.991       98.984
GET       2.079       99.062
GET       2.175       99.141
GET       2.271       99.219
GET       2.335       99.258
GET       2.399       99.297
GET       2.447       99.336
GET       2.527       99.375
GET       2.607       99.414
GET       2.687       99.453
GET       2.783       99.492
GET       2.879       99.531
GET       2.991       99.570
GET       3.119       99.609
GET       3.199       99.629
GET       3.279       99.648
GET       3.343       99.668
GET       3.439       99.688
GET       3.535       99.707
GET       3.647       99.727
GET       3.759       99.746
GET       3.871       99.766
GET       4.031       99.785
GET       4.191       99.805
GET       4.287       99.814
GET       4.351       99.824
GET       4.447       99.834
GET       4.575       99.844
GET       4.703       99.854
GET       4.831       99.863
GET       4.991       99.873
GET       5.151       99.883
GET       5.343       99.893
GET       5.567       99.902
GET       5.695       99.907
GET       5.855       99.912
GET       6.015       99.917
GET       6.207       99.922
GET       6.367       99.927
GET       6.591       99.932
GET       6.847       99.937
GET       7.103       99.941
GET       7.391       99.946
GET       7.743       99.951
GET       7.935       99.954
GET       8.159       99.956
GET       8.447       99.958
GET       8.767       99.961
GET       9.087       99.963
GET       9.407       99.966
GET       9.727       99.968
GET      10.111       99.971
GET      10.687       99.973
GET      11.391       99.976
GET      11.839       99.977
GET      12.415       99.978
GET      13.119       99.979
GET      14.271       99.980
GET      15.231       99.982
GET      17.535       99.983
GET      22.527       99.984
GET     210.943       99.985
GET     211.967       99.987
GET     212.991       99.988
GET     212.991       99.988
GET     212.991       99.989
GET     214.015       99.990
GET     214.015       99.990
GET     215.039       99.991
GET     215.039       99.991
GET     216.063       99.992
GET     216.063       99.993
GET     217.087       99.993
GET     217.087       99.994
GET     217.087       99.994
GET     217.087       99.995
GET     218.111       99.995
GET     218.111       99.995
GET     218.111       99.995
GET     218.111       99.996
GET     219.135       99.996
GET     219.135       99.996
GET     219.135       99.997
GET     219.135       99.997
GET     219.135       99.997
[...]
GET     219.135       99.998
GET     220.159       99.998
GET     220.159       99.998
GET     220.159       99.998
[...]
GET     220.159       99.999
GET     220.159       99.999
GET     220.159       99.999
[...]
GET     221.183       99.999
GET     221.183       99.999
GET     221.183       99.999
[...]
GET     222.207       99.999
GET     222.207      100.000
GET     222.207      100.000
GET     223.231      100.000
GET     224.255      100.000
GET     225.279      100.000
GET     225.279      100.000
GET     225.279      100.000
GET     226.303      100.000
GET     226.303      100.000
GET     227.327      100.000
GET     227.327      100.000
GET     227.327      100.000
[...]
GET     229.375      100.000
GET     229.375      100.000
GET     229.375      100.000
[...]
GET     230.399      100.000
GET     230.399      100.000
GET     230.399      100.000
[...]
GET     235.519      100.000
GET     235.519      100.000
---
WAIT      0.000      100.000